RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_dts.h
/* Private types -----------------------------------------------------------------------------------------------------*/
/* Private constants -------------------------------------------------------------------------------------------------*/
/** @defgroup DTS_Private_Constants DTS Private Constants
  * @{
  */
/** @defgroup DTS_ExtiLine DTS EXTI Lines
  * @{
  */
#define DTS_EXTI_LINE_DTS1   (EXTI_IMR3_IM77)  /*!< EXTI line 77 connected to DTS1 output */
/**
  * @}
  */
/**
  * @}
  */

/* Private macros ----------------------------------------------------------------------------------------------------*/
/** @defgroup DTS_Private_Macros DTS Private Macros
  * @{
  */

/** @defgroup DTS_IS_DTS_Definitions  DTS Private macros to check input parameters
  * @{
  */
#define IS_DTS_QUICKMEAS(__SEL__)   (((__SEL__) == DTS_QUICKMEAS_DISABLE) || \
                                     ((__SEL__) == DTS_QUICKMEAS_ENABLE))

#define IS_DTS_REFCLK(__SEL__)      (((__SEL__) == DTS_REFCLKSEL_LSE) || \
                                     ((__SEL__) == DTS_REFCLKSEL_PCLK))
#define IS_DTS_TRIGGERINPUT(__INPUT__)  (((__INPUT__) == DTS_TRIGGER_HW_NONE)   || \
                                         ((__INPUT__) == DTS_TRIGGER_LPTIMER4)  || \
                                         ((__INPUT__) == DTS_TRIGGER_LPTIMER2)  || \
                                         ((__INPUT__) == DTS_TRIGGER_LPTIMER3)  || \
                                         ((__INPUT__) == DTS_TRIGGER_EXTI13))

#define IS_DTS_THRESHOLD(__THRESHOLD__)  ((__THRESHOLD__) <= 0xFFFFUL)

#define IS_DTS_DIVIDER_RATIO_NUMBER(__NUMBER__) ((__NUMBER__) <= 127UL)

#define IS_DTS_SAMPLINGTIME(__CYCLE__)  (((__CYCLE__) == DTS_SMP_TIME_1_CYCLE)  || \
                                         ((__CYCLE__) == DTS_SMP_TIME_2_CYCLE)    || \
                                         ((__CYCLE__) == DTS_SMP_TIME_3_CYCLE)    || \
                                         ((__CYCLE__) == DTS_SMP_TIME_4_CYCLE)    || \
                                         ((__CYCLE__) == DTS_SMP_TIME_5_CYCLE)    || \
                                         ((__CYCLE__) == DTS_SMP_TIME_6_CYCLE)    || \
                                         ((__CYCLE__) == DTS_SMP_TIME_7_CYCLE)    || \
                                         ((__CYCLE__) == DTS_SMP_TIME_8_CYCLE)    || \
                                         ((__CYCLE__) == DTS_SMP_TIME_9_CYCLE)    || \
                                         ((__CYCLE__) == DTS_SMP_TIME_10_CYCLE)   || \
                                         ((__CYCLE__) == DTS_SMP_TIME_11_CYCLE)   || \
                                         ((__CYCLE__) == DTS_SMP_TIME_12_CYCLE)   || \
                                         ((__CYCLE__) == DTS_SMP_TIME_13_CYCLE)   || \
                                         ((__CYCLE__) == DTS_SMP_TIME_14_CYCLE)   || \
                                         ((__CYCLE__) == DTS_SMP_TIME_15_CYCLE))

/**
  * @}
  */

/**
  * @}
  */

/* Private functions -------------------------------------------------------------------------------------------------*/

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32H7RSxx_HAL_DTS_H */
